Revit 2026 API

# SpaceLightingCalculationWorkplane Property

---

Get or set the Lighting Calculation Workplane of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LightingCalculationWorkplane { get; set; }
```
```vb
Public Property LightingCalculationWorkplane As Double
	Get
	Set
```
```cpp
public:
property double LightingCalculationWorkplane {
	double get ();
	void set (double value);
}
```
```fsharp
member LightingCalculationWorkplane : float with get, set
```

#### Property Value

Double

This property is used to get or set the Lighting Calculation Workplane (Unit: feet) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace